do
    
    local function Th3_BOOS(msg, matches)
  if is_sudo(msg) then
      return [[
      
      
      هنا قائمه الهيلب للمطورين
      
      
      ]]
elseif is_owner(msg) then
  return [[
  
  هيلب المدير
  
  ]]
elseif  is_momod(msg)then
    return [[
    قائمة الاوامر الخاصة بالادمنيه🌝❤️

📛ايدي«لأضهار ايدي المجموعه〽️
📛ايدي➕بالرد على الشخص لضهور الايدي الخاص بهي
📛تحويل +الكلمه> >تحويل الكلام ملصق‼️
📛شنو اني»لمعرفت موقعك في المجموعه
📛زخرفه»لزخرفة الاسم فقط عربي〽️
📛زخرف»ايضا لزخرفة الاسم عربي 🔆
📛ملصق»لتحويل الصوره ملصق💯
📛صورة»لتحويل الملصق صوره🌄
📛معلوماتي»لمعرفتك معلومات داخل المجموعه
📛معلومات المجموعه»لأضهار معلومات المجموعه
📛الاعدادات»لمعرفت اعدادات المجموعه⚜
📛تشكيل +اسمك» لعمل تشكيله لاسمك
📛الاذان +المنطقه»لمعرفه وقت الاذان🕋
📛اختصر+الرابط»لأختصار الرابط💢
📛ترجم+الكلمه عربي» ترجمه الى الانكلش
📛دعم»لأرسال رابط دعم البوت♨️
✳️ضع تكرار+العدد»لوضع حد تكرار في المجموعه♨️

اوامر الحمايه للادمن🌚👇🏽👇🏽

💟-فتح🔓قفل🔒 الكل
💟-فتح🔓قفل🔒الدخول
💟-فتح🔓قفل🔒 المغادره
💟-فتح🔓قفل🔒 التكرار
💟-فتح🔓قفل🔒 اللغه العربيه
💟-فتح🔓قفل🔒 اللغه الانكليزيه
💟-فتح🔓قفل🔒 الاضافه الجماعيه
💟-فتح🔓قفل🔒 المسح
💟-فتح🔓قفل🔒 الملصقات
💟-فتح🔓قفل🔒 جهات الاتصال
💟-فتح🔓قفل🔒 الاضافه 
💟-فتح🔓قفل🔒 الحمايه الخارقه 
💟-فتح🔓قفل🔒 السمايلات 
💟-فتح🔓قفل🔒 الكلمات السيئه 
💟-فتح🔓قفل🔒 ميديا   
💟-فتح🔓قفل🔒  اليوزر
💟-فتح🔓قفل🔒  البوتات
💟-فتح🔓قفل🔒  الروابط

اوامر قفل المديا🌝👇🏽👇🏽
✅-فتح🔓قفل🔒 الصوت 
✅-فتح🔓قفل🔒  الصور 
✅-فتح🔓قفل🔒 الفديو   
✅-فتح🔓قفل🔒  الملفات
✅-فتح🔓قفل🔒  اصور المتحركه
✅-فتح🔓قفل🔒  الدردشه
✅-فتح🔓قفل🔒  الكلام

🔰>مطور البوت  @Th3_BOOS
🔰>مطور البوت  @i_v_v
🌀 قناة البوت  @DEV_Th3_BOOS
⚠️كروب دعم البوت
    ]]
elseif not is_momod(msg) then
return [[

قائمة الاوامر الخاصة بالعضو🌚👇🏽

💠ايدي«لأضهار ايدي المجموعه💜
💠ايدي➕بالرد على الشخص لضهور الايدي الخاص بهي
💠تحويل +الكلمه> >تحويل الكلام ملصق‼️
💠شنو اني»لمعرفت موقعك في المجموعه💙
💠زخرفه»لزخرفة الاسم فقط عربي💛
💠زخرف»ايضا لزخرفة الاسم عربي ❤️
💠ملصق»لتحويل الصوره ملصق💝
💠صورة»لتحويل الملصق صوره💘
💠معلوماتي»لمعرفتك معلومات داخل المجموعه
💠معلومات المجموعه»لأضهار معلومات المجموعه
💠الاعدادات»لمعرفت اعدادات المجموعه💙
💠تشكيل +اسمك» لعمل تشكيله لاسمك❤️
💠الاذان +المنطقه»لمعرفه وقت الاذان💙
💠اختصر+الرابط»لأختصار الرابط‼️
💠ترجم+الكلمه عربي» ترجمه الى الانكلش❤️
💠دعم»لأرسال رابط دعم البوت❤️

🔰>مطور البوت  @Th3_BOOS
🔰>مطور البوت  @i_v_v
🌀 قناة البوت  @DEV_Th3_BOOS
⚠️كروب دعم البوتبّالُبّوَتْ

]]
end 
end

    return {
        patterns = {
            "^(مساعده)$"
        },
        run = Th3_BOOS,
    }
end

 -- BY @Th3_BOOS